woo/app/views/general/_myactivityinfo4.html.erb

			                        <a href="#" class="big_box">
			       <% if Yactivity.find(a.yactivity_id).avatar.url %>
---
SELECT  "yactivities".* FROM "yactivities"  WHERE "yactivities"."id" = ? LIMIT 1

			                        </div>
						   	<% Interestanswer.where(:answer=>true, :name => Yactivity.find(a.yactivity_id).name).limit(6).each do |u| %>

							 <%= link_to (image_tag User.find(u.user_id).avatar.url(:supermini),:class => 'img-circle', :height =>'30', :width => '30'), {:controller => 'profile', :action => 'show', :id => u.user_id } %>
---
SELECT  "interestanswers".* FROM "interestanswers"  WHERE "interestanswers"."answer" = 't' AND "interestanswers"."name" = 'Travel' LIMIT 6
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1


  <%= Interestanswer.where(:answer=>true, :name => Yactivity.find(a.yactivity_id).name).count %> liked this activity.

---
SELECT COUNT(*) FROM "interestanswers"  WHERE "interestanswers"."answer" = 't' AND "interestanswers"."name" = 'Travel'