woo/app/controllers/application_controller.rb

  def notif_count
    @Private_activity = PublicActivity::Activity.order('created_at DESC').where("events.recipient_id = ? AND notif = 'on'", current_user)
---
SELECT "events".* FROM "events"  WHERE (events.recipient_id = 3 AND notif = 'on') ORDER BY created_at DESC

   def notif
         @notif = Notif.last.shout
         @notifuser = User.find(Notif.last.user_id)
---
SELECT  "notifs".* FROM "notifs"  ORDER BY "notifs"."id" DESC LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1