woo/app/controllers/profile_controller.rb

SELECT  "users".* FROM "users"  WHERE (updated_at > '2017-03-22 01:11:20.992163') LIMIT 9
SELECT COUNT(*) FROM "activities"  WHERE "activities"."user_id" = 3 AND "activities"."user_id" = 3
SELECT "userinterests".* FROM "userinterests"  WHERE "userinterests"."user_id" = 3
SELECT "albums".* FROM "albums"  WHERE "albums"."user_id" = 3
---
  def edit
   @user = current_user
   @useronline = User.online.find(:all, :limit => 9)
   @loc = @user.location
   @interestcount = @user.userinterests.find(:all).count
   @activitiescount = @user.activities.where(:user_id => @user.id).count
   @completion = @user.completion

   @album = @user.albums.new
   @albums = @user.albums.all

SELECT  activities.*, NULL AS distance, NULL AS bearing FROM "activities"  WHERE (0) ORDER BY "activities"."id" DESC LIMIT 7
---
      @result = @user.location
      if @result

      @activitygrid = Activity.near(@result, 1000, :order => :ending).reverse_order.first(7)

SELECT  "users".* FROM "users"  WHERE (updated_at > '2017-03-22 01:10:39.013242') LIMIT 9
SELECT "dares".* FROM "dares"  WHERE "dares"."user_id" = 3
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1
SELECT "albums".* FROM "albums"  WHERE "albums"."user_id" = 4
SELECT COUNT(*) FROM "activities"  WHERE "activities"."user_id" = 4 AND "activities"."user_id" = 4
SELECT  "activities".* FROM "activities"  LIMIT 1
SELECT  "users".* FROM "users"  WHERE (updated_at > '2017-03-22 01:10:42.263842') LIMIT 9
SELECT "userinterests".* FROM "userinterests"  WHERE "userinterests"."user_id" = 4
---
  def show

    @user = current_user
    @useronline = User.online.find(:all, :limit => 9)
    @loc = @user.location

    @completion = @user.completion
      @question_set = @user.dares.all
    @userview = User.find(params[:id])
    @dare = @user.dares.new
    @myalbumpics = @userview.albums.all

    Visit.track(@userview,current_user)
    @interestcount = @userview.userinterests.find(:all).count
    @activitiescount = @userview.activities.where(:user_id => @userview.id).count

    @activity = Activity.first
    @useronline = User.online.find(:all, :limit => 9)

    @array1 = []
    @userview.userinterests.each do |c|