woo/app/controllers/yactivities_controller.rb

  def home

      @activitynow  = Kaminari.paginate_array(Interestanswer.where(:answer => true).reverse).page(params[:page]).per(9)


      @user = current_user
      if @user.location.nil? || @user.location.blank?
        @user.location = @loc
        @user.save
      end
      @selected_activities = Activity.find(:all, :order => "id desc", :limit => 24).reverse

      @allfollow = @user.following_by_type('Activity')
      @myact =  @user.activities
      @activityall = Activity.near([current_user.latitude,current_user.longitude],200)
      @act = @activityall - @allfollow - @myact

      if   @act.sample.nil?
        params[:id] = "1"
      else
      @activities = @act.sample
      end





    @peoplevisitingme = Visit.where(:visitable_id => current_user, :visitable_type => "User")

      unless @peoplevisitingme[0].nil?

     @myvisitor = @peoplevisitingme[0].visit_details.pluck(:ip_address)
---
SELECT "interestanswers".* FROM "interestanswers"  WHERE "interestanswers"."answer" = 't'
SELECT activities.*, (69.09332411348201 * ABS(activities.latitude - 45.498977) * 0.7071067811865475) + (59.836573914187355 * ABS(activities.longitude - -73.569929) * 0.7071067811865475) AS distance, CASE WHEN (activities.latitude >= 45.498977 AND activities.longitude >= -73.569929) THEN  45.0 WHEN (activities.latitude <  45.498977 AND activities.longitude >= -73.569929) THEN 135.0 WHEN (activities.latitude <  45.498977 AND activities.longitude <  -73.569929) THEN 225.0 WHEN (activities.latitude >= 45.498977 AND activities.longitude <  -73.569929) THEN 315.0 END AS bearing FROM "activities"  WHERE (activities.latitude BETWEEN 42.60434133778304 AND 48.39361266221695 AND activities.longitude BETWEEN -77.6996833322101 AND -69.4401746677899) ORDER BY distance ASC
SELECT "visits".* FROM "visits"  WHERE "visits"."visitable_id" = 3 AND "visits"."visitable_type" = 'User'
SELECT ip_address FROM "visit_details"  WHERE "visit_details"."visit_id" = 8

      end

      userinteresttotal = Yactivity.find(:all).map {|r| r.id}
      userinterest = @user.interestanswers.find(:all).map {|r| r.yactivity_id}
---
SELECT "interestanswers".* FROM "interestanswers"  WHERE "interestanswers"."user_id" = 3


      if !@randomyactivity.nil?

        @yactivities = Yactivity.find(@randomyactivity)
---
SELECT  "yactivities".* FROM "yactivities"  WHERE "yactivities"."id" = ? LIMIT 1




    @useronline = User.online.find(:all, :limit => 9)
    @loc = @user.location
    @interestcount = @user.userinterests.find(:all).count
    @activitiescount = @user.activities.where(:user_id => @user.id).count
---
SELECT  "users".* FROM "users"  WHERE (updated_at > '2017-03-22 01:11:27.464820') LIMIT 9
SELECT COUNT(*) FROM "activities"  WHERE "activities"."user_id" = 3 AND "activities"."user_id" = 3

    public_destroy = PublicActivity::Activity.order('created_at DESC').limit(300).where(:key => "follow.destroy")
    public_array_all = PublicActivity::Activity.order('created_at DESC').limit(300)
    public_want_to_part =  PublicActivity::Activity.order('created_at DESC').where('events.key = ?', "wanto_participate").limit(100)
    public_accepted =  PublicActivity::Activity.order('created_at DESC').where('events.key = ?', "accepted").limit(100)
---
SELECT  "events".* FROM "events"  WHERE (events.key = 'wanto_participate') ORDER BY created_at DESC LIMIT 100

  def yesbutton
     @user = current_user
     theid = params[:id]
     name = Yactivity.find(theid).name
---
SELECT  "activities".* FROM "activities"  WHERE "activities"."id" = 1 LIMIT 1