woo/app/views/yactivities/home.html.erb

					</div>
					<div class="right-panel"><span class="orange2" >&nbsp;&nbsp;<%= current_user.activities.count %> </span></a>
---
SELECT COUNT(*) FROM "activities"  WHERE "activities"."user_id" = 3