woo/app/models/user.rb

SELECT COUNT(*) FROM "userinterests"  WHERE "userinterests"."user_id" = 3
---
  def completion
    progression = 0
    PROFILE_COMPLETENESS.each do |c|
      if !self.attributes[c].blank?
        progression += 1
      else
      end
    end
     progression
     if !self.userinterests.empty?