woo/app/models/visit.rb

    def self.track(obj, ip_address)
        visit = Visit.find_or_create_by_visitable_id_and_visitable_type(obj.id, obj.class.name)
        ### check if visit is unique
        unless VisitDetail.find_by_visit_id_and_ip_address(visit.id, ip_address)
             visit.increment!(:unique_visits)
        end
        visit.increment!(:total_visits)
        visit_detail = visit.visit_details.create(:ip_address => ip_address)
---
SELECT  "visits".* FROM "visits"  WHERE "visits"."visitable_id" = 4 AND "visits"."visitable_type" = 'User' LIMIT 1
SELECT  "visit_details".* FROM "visit_details"  WHERE "visit_details"."visit_id" = 6 AND "visit_details"."ip_address" = 3 LIMIT 1
UPDATE "visits" SET "total_visits" = 14, "updated_at" = '2017-03-22 17:50:41.990829' WHERE "visits"."id" = 6
INSERT INTO "visit_details" ("created_at", "ip_address", "updated_at", "visit_id") VALUES (?, ?, ?, ?)